package com.example.mybookactivity.logic.model;

import java.io.Serializable;


public class BookPassage implements Serializable {

    /**
     * status : 1
     * info : success
     * data : {"id":608945,"name":"我开局震惊了女帝","cid":3101682,"cname":"第1章 震惊!女帝是我老婆!","pid":-1,"nid":3101683,"content":"\u201c我...我这是穿越了！？\u201d\r\n　　\r\n　　古香古色的房间内，宁天躺在充满女子清香的柔软床上，一脸震惊！\r\n　　\r\n　　柔软的床上，还静静的躺着女子的衣物，淡淡的清香让宁天有些感觉异样。\r\n　　\r\n　　不对啊？\r\n　　\r\n　　这到底是什么情况！？\r\n　　\r\n　　宁天咽了咽口水，女子的房间，柔软的床，女子的衣物以及躺在床上感觉到身体疼痛的宁天！\r\n　　\r\n　　卧槽！\r\n　　\r\n　　我不会被那个了吧？\r\n　　\r\n　　宁天嘴角一扯，想到了一个很荒唐的事情，他躺在这里就只能是那个结果了！\r\n　　\r\n　　他咬着牙，似乎是在回想什么，但却是对发生的事情没有一点印象。\r\n　　\r\n　　我堂堂地球好男儿，竟然穿越后惨被\u2026那个了？\r\n　　\r\n　　该不会是一个丑女吧？\r\n　　\r\n　　说不定，也可能是一个极为美丽的女子？\r\n　　\r\n　　但总之，亏大了啊！\r\n　　\r\n　　宁天叹了口气，想要从床上爬起来，可就在这时，一股庞大的记忆伴随着剧痛传入了他的脑海中。\r\n　　\r\n　　半晌后，他终于搞清楚了这一切究竟是怎么回事。\r\n　　\r\n　　他穿越到了一个名为天玄大陆的世界，这里有一套完整的修炼体系，修炼大能者，则是能移山倒海，飞天遁地，无所不能！\r\n　　\r\n　　而他现在处于的位置，便是天灵域，东兴国的天魔教内！\r\n　　\r\n　　\u201c等等？\u201d\r\n　　\r\n　　突然，宁天在整理记忆时，却是发现了一个让他震惊的事情！\r\n　　\r\n　　\u201c我是一个废物？\u201d\r\n　　\r\n　　宁天傻眼了，他现在的身份竟然是天魔教内一个打杂的，而且，还是一个货真价实的废物！\r\n　　\r\n　　\u201c我他喵！\u201d\r\n　　\r\n　　宁天突然有了一种自行了断，回炉重造的念头，在这种玄幻世界内，他是一个废物的话，那不就完犊子了么！\r\n　　\r\n　　突然，一缕记忆碎片再次涌入了脑海中。\r\n　　\r\n　　让他的念头有了一丝回转，事情好像还有所转机？\r\n　　\r\n　　\u201c天魔教的教主女帝，竟然是我老婆？\u201d\r\n　　\r\n　　\u201c今天就是我和女帝的成亲大典？\u201d\r\n　　\r\n　　\u201c那周围的衣物，岂不就是女帝的东西？\u201d\r\n　　\r\n　　宁天神情变得古怪，为啥堂堂一教之主，被人敬称为女帝的她，要在今晚和自己成亲？\r\n　　\r\n　　咔吱。\r\n　　\r\n　　就在他回忆之时，房门被推开，发出一道微微的咔吱声响。\r\n　　\r\n　　接着，一道香风袭来，一个窈窕的倩影走了进来。\r\n　　\r\n　　一身蓝白长裙，头戴凤冠，身材窈窕的女子走来，那一双美眸似是洛水无情，容颜绝美，美得令人惊心动魄。\r\n　　\r\n　　看到她，宁天眼中闪过一抹惊艳！\r\n　　\r\n　　这进来的女子就是自己名义上的老婆，天魔教的教主，被人敬称为女帝的洛无情！\r\n　　\r\n　　这个女子，比他在地球上，见过的所有女子都要漂亮，什么女明星见了她，都要靠边站啊！\r\n　　\r\n　　这一刻，宁天只有一个念头。\r\n　　\r\n　　那就是\u2026\r\n　　\r\n　　赚大发了啊！\r\n　　\r\n　　\u201c你醒了。\u201d\r\n　　\r\n　　洛无情抬眸淡淡的看了眼床上的宁天，语气冰冷，犹如冰天雪地中的冰莲一般。\r\n　　\r\n　　\u201c既然你醒了，我也不废话了。\u201d\r\n　　\r\n　　不等宁天开口，洛无情便是继续说，\u201c我们只是假成亲，你不要以为是真成亲，最多只能算是名义上的夫妻，所以，你不能对我有任何的非分之想。\u201d\r\n　　\r\n　　\u201c若是你有任何想法，我随时都能洞察，到时候可就不要怪我真无情了。\u201d\r\n　　\r\n　　闻言，宁天眉头皱了皱，很是不爽。\r\n　　\r\n　　他已经够惨了，没想到白给他一个老婆，居然还是假成亲？\r\n　　\r\n　　那岂不是只能看，不能碰？\r\n　　\r\n　　叮！\r\n　　\r\n　　就在这时，宁天脑海中却是响起了一道机械般的声音。\r\n　　\r\n　　\u201c叮！恭喜宿主激活震惊系统！\u201d\r\n　　\r\n　　嗯？\r\n　　\r\n　　系统？\r\n　　\r\n　　原本还在不爽的宁天，不由愣在了原地，接着脸上浮现了一抹狂喜之色！\r\n　　\r\n　　身为穿越之人，他自然是明白，何为系统！\r\n　　\r\n　　那便是能帮助他咸鱼大翻身的绝佳之物啊，有了系统，还怕是废材？\r\n　　\r\n　　只不过，这系统有什么作用？\r\n　　\r\n　　除了那一声提示，似乎就没有了下文？\r\n　　\r\n　　就在宁天研究系统的时候，一旁洛无情早就注意到了他的表情一悲一喜，她柳眉皱了皱，这家伙在搞什么？\r\n　　\r\n　　\u201c你有没有在听我说话？\u201d\r\n　　\r\n　　洛无情开口，语气冰冷，且充满绝对威严。\r\n　　\r\n　　听到耳边声音，还在研究事关命运的宁天皱了皱眉，下意识的就冷喝了一句，\u201c闭嘴！忙着呢！\u201d\r\n　　\r\n　　\u201c嗯？\u201d\r\n　　\r\n　　洛无情一愣，美眸中掠过一丝惊愕。\r\n　　\r\n　　她什么身份？\r\n　　\r\n　　堂堂神帝级高手，天魔教的宗主，被称之为一方女帝！谁敢对她如此无礼？\r\n　　\r\n　　而宁天什么身份？\r\n　　\r\n　　区区一个天魔教打杂的废物而已。\r\n　　\r\n　　可是，身为女帝的她，竟然被宁天给呵斥了？\r\n　　\r\n　　这一刻，洛无情心底间不由流露出一丝惊愕，这家伙是不怕死吗？\r\n　　\r\n　　当宁天说完这句话的时候，就有些后悔了，他现在可还是一个战斗力为零的渣渣，洛无情抬手就能碾死他了。\r\n　　\r\n　　是不是，有些太冲动了？\r\n　　\r\n　　这时，脑海中响起一道系统提示声。\r\n　　\r\n　　【恭喜宿主完成第一次震惊，奖励一次气场压制技能！】\r\n　　\r\n　　【气场压制：压制对方，三个小时内无法动用任何灵气！】\r\n　　\r\n　　嗯？\r\n　　\r\n　　震惊奖励？\r\n　　\r\n　　难不成是因为我刚刚呵斥了洛无情？\r\n　　\r\n　　宁天楞了一下，很快便是反应了过来，他眼睛一亮，原来这系统是这么用的！\r\n　　\r\n　　达到了一定程度的震惊，就能获得一定的奖励！\r\n　　\r\n　　\u201c你刚刚说什么？\u201d\r\n　　\r\n　　洛无情一双好看的美眸落在了宁天的身上，眼波流转间流露出来了一抹冷淡之意。\r\n　　\r\n　　若是之前的宁天肯定会退缩，但是现在明白了系统的作用后，他似乎知道该怎么做了。\r\n　　\r\n　　咬了咬牙，鼓足勇气！\r\n　　\r\n　　女帝又如何？\r\n　　\r\n　　大不了拼一把，单车变摩托！\r\n　　\r\n　　\u201c怎么，我是你夫君，我这么和你说话你有意见吗？\u201d宁天淡淡的看着洛无情，这一刻，他装起来了！\r\n　　\r\n　　\u201c嗯？\u201d\r\n　　\r\n　　洛无情眼中再一次的闪过一抹惊愕，这个家伙怎么突然有了这个胆子？\r\n　　\r\n　　此刻，宁天的脑海中却是响起声音。\r\n　　\r\n　　【恭喜宿主完成一次普通震惊，奖励气血丹：调整经脉，修复体质。】\r\n　　\r\n　　尝到了甜头的宁天更加得寸进尺。\r\n　　\r\n　　他站起身来，走到洛无情身旁，拉住了她那柔若无骨的玉手，带她坐在床边。\r\n　　\r\n　　嘴角微微勾勒而起，宁天笑看洛无情，\u201c你说，既然咱们都是夫妻了，是不是该做一些夫妻该做的事情？\u201d\r\n　　\r\n　　\u201c什么？\u201d\r\n　　\r\n　　洛无情本想看看宁天到底想要做什么，但是听到这一句话，美眸中闪过了一抹深深的震惊！\r\n　　\r\n　　接着，便是勃然大怒！\r\n　　\r\n　　这个家伙，是不是太得寸进尺了？\r\n　　\r\n　　【恭喜宿主完成了一次中级震惊，已自动吞服气血丹，体内经脉正在修复，已觉醒神级十倍修炼体质！】\r\n　　\r\n　　【当前每秒吸收十倍灵气！】\r\n　　\r\n　　【武学领悟程度加十倍！】\r\n　　\r\n　　【功法修炼速度加十倍！】\r\n　　\r\n　　这一刻，宁天感知到了原本虚弱的身体，在这时充满了力量，源源不断的灵气融入身体。\r\n　　\r\n　　\u201c你，是在找死么？\u201d\r\n　　\r\n　　就在这时，耳边响起一道冷淡声音，声音中充满了一丝杀意。\r\n　　\r\n　　宁天一愣，下意识的转过了头。\r\n　　\r\n　　便是看到，洛无情正盯着他，美眸中不经意间流转出来了一抹杀意，一抹神帝级的强大气息，瞬间将宁天笼罩！\r\n　　\r\n　　感知身体无法动弹，宁天脸色大变。\r\n　　\r\n　　完了！\r\n　　\r\n　　这下玩过头了！\r\n　　\r\n　　两人现在的姿势极为奇怪，宁天被死死的压制在床上，而洛无情冰凉的手放在了他的胸膛处，死死的压制着他。\r\n　　\r\n　　感受柔弱无骨的玉手，宁天却半点都享受不起来。\r\n　　\r\n　　\u201c说吧，你想怎么死？\u201d洛无情淡淡道。\r\n　　\r\n　　她真要杀自己？\r\n　　\r\n　　宁天咬了咬牙，不管洛无情是否要真杀自己，他必须要现在反击！\r\n　　\r\n　　他心中默念，\u201c发动气场压制！\u201d\r\n　　\r\n　　轰！\r\n　　\r\n　　接着，从他的身体中一道黑色气息浮现，瞬间气场笼罩，直接将洛无情压制！\r\n　　\r\n　　这一刻，她身体中灵气消散的无影无踪，身体一软，便是朝着宁天倒了下来。\r\n　　\r\n　　\u201c什么？\u201d\r\n　　\r\n　　洛无情美眸中闪过一抹惊愕，她神帝级的实力呢？\r\n　　\r\n　　宁天一把将洛无揽在了怀中，感受到怀中的柔软，他咬了咬牙，眼中闪过一抹狠意！\r\n　　\r\n　　一不做二不休，现在退缩了，等气场压制时间一到，他肯定必死无疑！\r\n　　\r\n　　倒不如放手一搏呢！\r\n　　\r\n　　\u201c反正昨天也做了，那今天就再来一次！\u201d\r\n　　\r\n　　\u201c今天，我就教教你这个女帝，什么叫做天大地大，老公最大！\u201d\r\n　　\r\n　　宁天咬了咬牙，在洛无情的惊愕的目光下，他迈出了人生大事中的第一步！\f\t\n","hasContent":1}
     */

    private int status;
    private String info;
    private DataBean data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean implements Serializable {
        /**
         * id : 608945
         * name : 我开局震惊了女帝
         * cid : 3101682
         * cname : 第1章 震惊!女帝是我老婆!
         * pid : -1
         * nid : 3101683
         * content : “我...我这是穿越了！？”

         古香古色的房间内，宁天躺在充满女子清香的柔软床上，一脸震惊！

         柔软的床上，还静静的躺着女子的衣物，淡淡的清香让宁天有些感觉异样。

         不对啊？

         这到底是什么情况！？

         宁天咽了咽口水，女子的房间，柔软的床，女子的衣物以及躺在床上感觉到身体疼痛的宁天！

         卧槽！

         我不会被那个了吧？

         宁天嘴角一扯，想到了一个很荒唐的事情，他躺在这里就只能是那个结果了！

         他咬着牙，似乎是在回想什么，但却是对发生的事情没有一点印象。

         我堂堂地球好男儿，竟然穿越后惨被…那个了？

         该不会是一个丑女吧？

         说不定，也可能是一个极为美丽的女子？

         但总之，亏大了啊！

         宁天叹了口气，想要从床上爬起来，可就在这时，一股庞大的记忆伴随着剧痛传入了他的脑海中。

         半晌后，他终于搞清楚了这一切究竟是怎么回事。

         他穿越到了一个名为天玄大陆的世界，这里有一套完整的修炼体系，修炼大能者，则是能移山倒海，飞天遁地，无所不能！

         而他现在处于的位置，便是天灵域，东兴国的天魔教内！

         “等等？”

         突然，宁天在整理记忆时，却是发现了一个让他震惊的事情！

         “我是一个废物？”

         宁天傻眼了，他现在的身份竟然是天魔教内一个打杂的，而且，还是一个货真价实的废物！

         “我他喵！”

         宁天突然有了一种自行了断，回炉重造的念头，在这种玄幻世界内，他是一个废物的话，那不就完犊子了么！

         突然，一缕记忆碎片再次涌入了脑海中。

         让他的念头有了一丝回转，事情好像还有所转机？

         “天魔教的教主女帝，竟然是我老婆？”

         “今天就是我和女帝的成亲大典？”

         “那周围的衣物，岂不就是女帝的东西？”

         宁天神情变得古怪，为啥堂堂一教之主，被人敬称为女帝的她，要在今晚和自己成亲？

         咔吱。

         就在他回忆之时，房门被推开，发出一道微微的咔吱声响。

         接着，一道香风袭来，一个窈窕的倩影走了进来。

         一身蓝白长裙，头戴凤冠，身材窈窕的女子走来，那一双美眸似是洛水无情，容颜绝美，美得令人惊心动魄。

         看到她，宁天眼中闪过一抹惊艳！

         这进来的女子就是自己名义上的老婆，天魔教的教主，被人敬称为女帝的洛无情！

         这个女子，比他在地球上，见过的所有女子都要漂亮，什么女明星见了她，都要靠边站啊！

         这一刻，宁天只有一个念头。

         那就是…

         赚大发了啊！

         “你醒了。”

         洛无情抬眸淡淡的看了眼床上的宁天，语气冰冷，犹如冰天雪地中的冰莲一般。

         “既然你醒了，我也不废话了。”

         不等宁天开口，洛无情便是继续说，“我们只是假成亲，你不要以为是真成亲，最多只能算是名义上的夫妻，所以，你不能对我有任何的非分之想。”

         “若是你有任何想法，我随时都能洞察，到时候可就不要怪我真无情了。”

         闻言，宁天眉头皱了皱，很是不爽。

         他已经够惨了，没想到白给他一个老婆，居然还是假成亲？

         那岂不是只能看，不能碰？

         叮！

         就在这时，宁天脑海中却是响起了一道机械般的声音。

         “叮！恭喜宿主激活震惊系统！”

         嗯？

         系统？

         原本还在不爽的宁天，不由愣在了原地，接着脸上浮现了一抹狂喜之色！

         身为穿越之人，他自然是明白，何为系统！

         那便是能帮助他咸鱼大翻身的绝佳之物啊，有了系统，还怕是废材？

         只不过，这系统有什么作用？

         除了那一声提示，似乎就没有了下文？

         就在宁天研究系统的时候，一旁洛无情早就注意到了他的表情一悲一喜，她柳眉皱了皱，这家伙在搞什么？

         “你有没有在听我说话？”

         洛无情开口，语气冰冷，且充满绝对威严。

         听到耳边声音，还在研究事关命运的宁天皱了皱眉，下意识的就冷喝了一句，“闭嘴！忙着呢！”

         “嗯？”

         洛无情一愣，美眸中掠过一丝惊愕。

         她什么身份？

         堂堂神帝级高手，天魔教的宗主，被称之为一方女帝！谁敢对她如此无礼？

         而宁天什么身份？

         区区一个天魔教打杂的废物而已。

         可是，身为女帝的她，竟然被宁天给呵斥了？

         这一刻，洛无情心底间不由流露出一丝惊愕，这家伙是不怕死吗？

         当宁天说完这句话的时候，就有些后悔了，他现在可还是一个战斗力为零的渣渣，洛无情抬手就能碾死他了。

         是不是，有些太冲动了？

         这时，脑海中响起一道系统提示声。

         【恭喜宿主完成第一次震惊，奖励一次气场压制技能！】

         【气场压制：压制对方，三个小时内无法动用任何灵气！】

         嗯？

         震惊奖励？

         难不成是因为我刚刚呵斥了洛无情？

         宁天楞了一下，很快便是反应了过来，他眼睛一亮，原来这系统是这么用的！

         达到了一定程度的震惊，就能获得一定的奖励！

         “你刚刚说什么？”

         洛无情一双好看的美眸落在了宁天的身上，眼波流转间流露出来了一抹冷淡之意。

         若是之前的宁天肯定会退缩，但是现在明白了系统的作用后，他似乎知道该怎么做了。

         咬了咬牙，鼓足勇气！

         女帝又如何？

         大不了拼一把，单车变摩托！

         “怎么，我是你夫君，我这么和你说话你有意见吗？”宁天淡淡的看着洛无情，这一刻，他装起来了！

         “嗯？”

         洛无情眼中再一次的闪过一抹惊愕，这个家伙怎么突然有了这个胆子？

         此刻，宁天的脑海中却是响起声音。

         【恭喜宿主完成一次普通震惊，奖励气血丹：调整经脉，修复体质。】

         尝到了甜头的宁天更加得寸进尺。

         他站起身来，走到洛无情身旁，拉住了她那柔若无骨的玉手，带她坐在床边。

         嘴角微微勾勒而起，宁天笑看洛无情，“你说，既然咱们都是夫妻了，是不是该做一些夫妻该做的事情？”

         “什么？”

         洛无情本想看看宁天到底想要做什么，但是听到这一句话，美眸中闪过了一抹深深的震惊！

         接着，便是勃然大怒！

         这个家伙，是不是太得寸进尺了？

         【恭喜宿主完成了一次中级震惊，已自动吞服气血丹，体内经脉正在修复，已觉醒神级十倍修炼体质！】

         【当前每秒吸收十倍灵气！】

         【武学领悟程度加十倍！】

         【功法修炼速度加十倍！】

         这一刻，宁天感知到了原本虚弱的身体，在这时充满了力量，源源不断的灵气融入身体。

         “你，是在找死么？”

         就在这时，耳边响起一道冷淡声音，声音中充满了一丝杀意。

         宁天一愣，下意识的转过了头。

         便是看到，洛无情正盯着他，美眸中不经意间流转出来了一抹杀意，一抹神帝级的强大气息，瞬间将宁天笼罩！

         感知身体无法动弹，宁天脸色大变。

         完了！

         这下玩过头了！

         两人现在的姿势极为奇怪，宁天被死死的压制在床上，而洛无情冰凉的手放在了他的胸膛处，死死的压制着他。

         感受柔弱无骨的玉手，宁天却半点都享受不起来。

         “说吧，你想怎么死？”洛无情淡淡道。

         她真要杀自己？

         宁天咬了咬牙，不管洛无情是否要真杀自己，他必须要现在反击！

         他心中默念，“发动气场压制！”

         轰！

         接着，从他的身体中一道黑色气息浮现，瞬间气场笼罩，直接将洛无情压制！

         这一刻，她身体中灵气消散的无影无踪，身体一软，便是朝着宁天倒了下来。

         “什么？”

         洛无情美眸中闪过一抹惊愕，她神帝级的实力呢？

         宁天一把将洛无揽在了怀中，感受到怀中的柔软，他咬了咬牙，眼中闪过一抹狠意！

         一不做二不休，现在退缩了，等气场压制时间一到，他肯定必死无疑！

         倒不如放手一搏呢！

         “反正昨天也做了，那今天就再来一次！”

         “今天，我就教教你这个女帝，什么叫做天大地大，老公最大！”

         宁天咬了咬牙，在洛无情的惊愕的目光下，他迈出了人生大事中的第一步！
         * hasContent : 1
         */

        private int id;
        private String name;
        private int cid;
        private String cname;
        private int pid;
        private int nid;
        private String content;
        private int hasContent;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public int getCid() {
            return cid;
        }

        public void setCid(int cid) {
            this.cid = cid;
        }

        public String getCname() {
            return cname;
        }

        public void setCname(String cname) {
            this.cname = cname;
        }

        public int getPid() {
            return pid;
        }

        public void setPid(int pid) {
            this.pid = pid;
        }

        public int getNid() {
            return nid;
        }

        public void setNid(int nid) {
            this.nid = nid;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public int getHasContent() {
            return hasContent;
        }

        public void setHasContent(int hasContent) {
            this.hasContent = hasContent;
        }
    }
}
